Repository: JianLaiTL/JianLai
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 陈平安拉着宁姚的手臂走下台阶，穿过铺子正堂来到大街上，陈平安笑问道：“是不是想不通？没事，杨爷爷就这样，不爱跟你讲人情，做什么事情都很……公道，对，就是很公道。宁姚冷笑道：“公道？人人心中有杆秤，他凭什么就觉得自己公道了？就凭年纪大啊？”
en_us: Chen Ping'an grabbed Ning Yao's arm and dragged her down the stairs. After leaving the pharmacy and arriving on the main street, Chen Ping'an smiled and asked, "Are you feeling puzzled? Don't worry, this is just how Grandpa Yang is. He doesn't like to give or accept favors, and everything that he does is very... fair. Yes, that's right, fair." Ning Yao chuckled coldly and said, "Fair? Everyone has a scale in their heart. What right does he have to think that he's the judge of fairness? Because of his age?"

source: 陈平安拿着碗筷，刚想要去灶房那边，发现不远处有人从这边走过，是一位袖子宽大的年轻男人，比读书人陈松风更像读书人，有一种说不清道不明的感觉，有点像齐先生，又有点像当时在泥瓶巷遇到的督造官宋大人。
en_us: Chen Ping'an was just about to make his way to the kitchen with the used bowls and chopsticks when he noticed someone approaching from not far away. It was a young man wearing a robe with wide, flapping sleeves, and he had even more of a scholarly air about him than Chen Songfeng. There was an indescribable quality about him that made him resemble Mr. Qi and the kiln supervision official, Master Song, in some ways.

source: 陈平安按照她手指指向的方位，捡起那两颗石子，走到墙边，她刚抬起手，草鞋少年就已经将石子放在墙头上。
en_us: Chen Ping'an picked up the two rocks that she was pointing at, then made his way over to the wall. She had only just raised a hand when Chen Ping'an set the rocks down on top of the wall.

source: 陈平安挑水回到刘羡阳家的院子，倒入灶房水缸里，然后跑到房门口喊道：“刘羡阳，我用下你家的柴禾油盐，要给宁姑娘炖鱼汤补补身体，可以吧”
en_us: Chen Ping'an returned to Liu Xianyang's house and poured the two buckets of water into the vat in the courtyard kitchen. He then ran to the door and shouted, "Liu Xianyang, I'm going to use your firewood and seasoning to make some fish soup for Ning Yao. Is that okay?"

source: 陈平安挑着水桶来到铁锁井的时候，中间经过杏花巷的几家早点铺子，肚子也不打声招呼就饿了起来，只是囊中羞涩，少年只能硬着头皮排队挑水，他前面还有三户人家，轮到他的时候，稚圭突然拎着只小水桶横插一脚，后边的人立马不乐意了。
en_us: Before Chen Ping'an arrived at the Iron Lock Well with his two buckets, he passed a few stalls on Apricot Blossom Alley that were selling breakfast, causing his stomach to rumble without warning. However, he was truly short of money, so he could only force himself to keep going and line up before the well to draw water. There were three families before him, and when it was his turn, Zhi Gui suddenly cut in front with a small bucket. This instantly caused the others behind him to grumble in anger.

source: 陈平安挠挠头。
en_us: Chen Ping'an scratched his head.

source: 陈平安挠挠头，总觉得哪里不对，可是少年口拙，实在不知道如何说服刘羡阳。
en_us: Chen Ping'an scratched his head. He had a nagging feeling that something was wrong, but he was a clumsy speaker and didn't know how he could persuade Liu Xianyang.

source: 陈平安挠挠头，有些忐忑，不知道杨老头是不是在说自己。
en_us: Chen Ping'an scratched his head, an uneasy expression on his face. He didn't know if Old Man Yang was talking about him.

source: 陈平安挠挠头，望着那块黑色石座，问道：“它叫斩龙台？”
en_us: Chen Ping'an scratched his head. He looked at the black statue base and asked, "That's called a Dragon Slaying Platform?"

source: 陈平安挠挠头，赧颜道：“我爹烧瓷厉害，打架很不行的，回家的时候鼻青脸肿，给人打惨了。”
en_us: Chen Ping'an scratched his head with an embarrassed expression as he explained, "My father was a great potter, but he was not good at all in fights. He was thoroughly beaten that day and came home all bruised and battered."

source: 陈平安挪开许多色泽已经干涸的蛇胆石后，看到水缸底部并无挖掘痕迹，这才松了口气。
en_us: Chen Ping'an pushed aside the snake gall pebbles that had already lost their luster. When he saw no dig marks on the bottom of the water vat, he finally breathed a sigh of relief.

source: 陈平安掏出一串钥匙，摘下其中一把，递给小女孩，“这是我家院门的钥匙，你拿着。我不要你多做什么，只是让你抢槐树枝的时候，看看地上有没有没有变黄的绿色树叶，有的话就记得帮我收起来。”
en_us: Chen Ping'an pulled out a string of keys, then plucked off one of them before handing it to the little girl. "This is the key to my yard gate. I don't need you to do much for me, just keep a look out for any green leaves that haven't turned yellow yet while you're fetching branches. If you spot any, make sure to keep them for me."

source: 陈平安掏出三袋子铜钱，放在椅子旁边的高凳上，然后对那个神色自若的男人说道：“宋大人，我知道你很厉害，我想知道你能不能救下刘羡阳，哪怕不能救，能不能给他一个公道，不让杀人凶手杀了人，只要离开小镇就好像什么事情都没有了。”
en_us: Chen Ping'an pulled out the three pouches of copper coins, then set them down onto the tall stool next to his chair before turning back to the white-robed man as he said, "Master Song, I know that you're a very powerful man, and I want to know if you can save Liu Xianyang. Even if you can't, would you be able to uphold justice for him? We can't just let the culprits get evicted from the town for killing him and have that be the end of the matter!"

source: 陈平安接过后，低头一看，相比那次齐先生带他去求来的槐叶，这些槐叶虽然也是绿色，但是叶脉已经枯黄，长久端详，也看不出有绿色莹光游走其中。
en_us: Chen Ping'an accepted the handful of leaves from her before closely examining them, and he discovered that even though these locust leaves were indeed green, the veins inside them were already yellow, and in contrast with the locust leaves that he had obtained with Mr. Qi in accompaniment, he wasn't able to see any green light moving within these leaves.

source: 陈平安接过那袋子钱，让开道路，雍容大方的妇人率先走入院子，卢正淳带着两名下人跟随其后，妇人亲自打开已经被摆在正堂的红漆木箱子，蹲下身，伸手抚摸那具模样丑陋的宝甲，眼神出现片刻迷离，然后是难以掩饰的炙热和渴望，但是这抹情绪很快就被妇人收敛，恢复正常神色，她站起身后，示意卢正淳可以动手搬箱子了，东西并不沉重，毕竟里头只有一具甲胄而已。
en_us: Chen Ping'an accepted the pouch of coins and moved aside to let them through. The graceful and bold woman was the first to enter the courtyard, with Lu Zhengchun and the two servants following after her. The woman personally opened the red wooden box that had already been carried to the main hall, and she bent down and reached over to stroke the ugly suit of armor. A hint of intoxication flashed through her eyes, followed by an expression of unconcealable fervor and desire. However, she quickly put her emotions in check. She stood up and gestured for Lu Zhengchun and the two servants to collect the box. It wasn't heavy, and this was because it only contained a single suit of armor.

source: 陈平安揉了揉下巴，“如果神仙也要拉屎的话，比较不像话啊。”
en_us: Chen Ping'an stroked his chin and replied, "If immortals also need to eat and shit... That seems a little unreasonable!"

source: 陈平安揉了揉小丫头的脑袋，温声解释道：“你自己事先藏起来，跟我事后送给你，是不一样的。以后别忘了，答应别人的事情，就一定要做到。”
en_us: Chen Ping'an patted her on the head as he explained in a gentle voice, "It's an entirely different concept for me to give you these leaves than for you to hide them in advance. Don't forget that if you make a promise to someone, then you have to follow through on that promise."

source: 陈平安揉着他的小脑袋，笑骂道：“傻样”
en_us: Chen Ping'an tousled his hair and scolded with a smile, "Silly boy."

source: 陈平安提醒道：“这位姐姐，你踩中狗屎，已经大半天了，为啥还不赶紧刮蹭掉？”
en_us: "It's already been quite some time since you stepped on the dog shit, why have you still not scraped it off yet?" Chen Ping'an asked with a perplexed expression.

source: 陈平安摇了摇头。
en_us: Chen Ping'an shook his head.

source: 陈平安摇了摇头，记起事，歉意道：“刚才还真在铁锁井那边遇上稚圭了，不过被马婆婆打岔，忘了帮你捎句话。等会儿我去给宁姑娘送鱼汤的时候，保证帮你把话带到。”
en_us: Chen Ping'an shook his head in reply. However, he also remembered Liu Xianyang's request at this moment, and he said apologetically, "I really did come across Zhi Gui at the Iron Lock Well just then. However, we were disturbed by Granny Ma, so I forgot to greet her for you. When I deliver the fish soup to Ning Yao in a moment, I promise that I'll head over to pass on your greeting."

source: 陈平安摇头。
en_us: Chen Ping'an shook his head in reply.

source: 陈平安摇头道：“三个人都找过了，其中两人见着面，齐先生没能看到，不过我一开始知道答案的。”
en_us: Chen Ping'an shook his head in response. "I was only able to meet three of the people I was looking for. I didn't get to meet Mr. Qi, but I already knew his answer from the very beginning."

source: 陈平安摇头道：“不是啊，是我自己这么觉得的。”
en_us: Chen Ping'an shook his head and replied, "No, it's not. It's just something that I came up with."

source: 陈平安摇头道：“不用，也不重。”
en_us: Chen Ping'an shook his head and replied, "No, I'm fine. It's not too heavy anyway."

source: 陈平安摇头道：“不知道。”
en_us: Chen Ping'an shook his head and replied, "No."

source: 陈平安摇头道：“不知道，我只在这个地方看过，其它山上好像都没有。”
en_us: Chen Ping'an shook his head in response. "No. I've only seen it here, I don't recall seeing it on any of the other mountains."

source: 陈平安摇头道：“两回事，不能比。”
en_us: "You can't compare those two things," Chen Ping'an said with a shake of his head.

source: 陈平安摇头道：“别逞强，要小心！”
en_us: Chen Ping'an shook his head and said, "Don't try to show off. You need to be careful!"

source: 陈平安摇头道：“可能关系好一些，但也好不到哪里去。”
en_us: Chen Ping'an shook his head and replied, "Perhaps our relationship would be better. However, it wouldn't be by much."

source: 陈平安摇头道：“如果老猿找到这里，就没差别了。”
en_us: "It won't make a difference if that old ape finds us," Chen Ping'an shook his head and said.

source: 陈平安摇头道：“宁姑娘你就别问了。”
en_us: "I'm not going to answer that question," Chen Ping'an replied with a shake of his head.

source: 陈平安摇头道：“我也很奇怪。”
en_us: Chen Ping'an shook his head. "I am indeed curious"

source: 陈平安摇头道：“我娘走之前，要我发过誓，可以当要饭的，哪怕饿死，也不许我给那些大户人家当下人。”
en_us: Chen Ping'an shook his head and said, "Before my mother passed away, she made me swear that I would never become a servant for those large clans and families. I could become a beggar, but even if I starved to death, I could never become their servant."

source: 陈平安摇头道：“我手脚笨，不说跟刘羡阳比，就是一般的学徒，我也比不上。姚老头看不上我，不奇怪。”
en_us: Chen Ping'an shook his head in response. "I had too little talent in the craft. I couldn't even compare with the average apprentice, let alone Liu Xianyang, so it's no wonder that Old Man Yao wasn't willing to teach me."

source: 陈平安摇头道：“我没有怪你爹。”
en_us: "I'm not blaming your father," Chen Ping'an replied with a shake of his head.

source: 陈平安摇头道：“我没觉得花出去一袋子铜钱，是当冤大头啊。”
en_us: Chen Ping'an shook his head, saying, "I don't feel like I'm being tricked if I pay him a pouch of copper coins."

source: 陈平安摇头道：“我确定阮师傅绝对没有开玩笑。”
en_us: Chen Ping'an shook his head and said, "I'm absolutely certain that Master Ruan wasn't joking."

source: 陈平安摇头道：“没事。我知道有些事情，就是这样的，没办法就是没办法。”
en_us: Chen Ping'an shook his head and replied, "I'm fine. I know that some things are just like this, and there's nothing we can do to change it."

source: 陈平安摇头道：“没关系。”
en_us: "It's fine," Chen Ping'an replied with a shake of his head.

source: 陈平安摇头道：“给她干什么，非亲非故的，当然是留给刘羡阳了。”
en_us: Chen Ping'an shook his head in response. "Why would I do that? I don't know her. I'm saving it for Liu Xianyang."

source: 陈平安摇头道：“进山不要一口气用掉所有力气，缓一下再继续，等到他逐渐适应后，是可以跟上我们的，他不是体力不济，只是气息乱了。”
en_us: Chen Ping'an shook his head and said, "When traversing through mountains, one shouldn't use all of their strength in a single breath. When he gradually grows accustomed to this, he will be able to keep up with us. It isn't his stamina that's lacking, and he's simply just a little short of breath."

source: 陈平安摇摇头。
en_us: Chen Ping'an shook his head.

source: 陈平安摇摇头。举手之劳，当然不麻烦。
en_us: "Not at all," Chen Ping'an replied with a shake of his head.

source: 陈平安摇身一变，成了铁匠铺的临时学徒，按照阮师傅的说法，需要有人顶替刘羡阳的活计，挖井、盖房、凿渠，都需要人手，他没有白白养活那位刘大爷的道理。
en_us: With a shake, Chen Ping'an suddenly became a temporary apprentice in Master Ruan's blacksmith shop. According to Master Ruan, someone needed fill the void that Liu Xianyang had left. He needed someone to dig wells, build houses, create canals, and so on. There was no reason for him to look after Liu Xianyang for free.

source: 陈平安摘下墙壁上那张自制的木弓，犹豫了一下，仍是暂时放弃携带它，反而从窗台上取回弹弓和一袋子石子。
en_us: He then pulled down a wooden bow from the wall that he had made himself, and after a brief moment of hesitation, he decided against bringing it. Instead, he picked up a slingshot and a bag of rocks that were sitting on his windowsill.

source: 陈平安摘下箩筐鱼篓，将它们放在溪边草丛里，深呼吸yi口气，在溪水中转身而走，开始练习走桩。
en_us: Chen Ping'an placed the bamboo basket and fish basket in the tall grass beside the creek before taking a deep breath and walking back ino the creek. He started to practice walking meditation.

source: 陈平安收回视线，穿街过巷，一路小跑向小镇东面，泥瓶巷在小镇西边，最东边的城门，有个人负责小镇商旅进出和夜禁巡防，平时也收取、转交一些从外边寄回来的家书，陈平安接下来要做的事情，就是把那些信送给小镇百姓，酬劳是一封信一枚铜钱，这还是他好不容易求来的挣钱门路，陈平安已经跟那边约好，在二月二龙抬头之后，就开始接手这摊子买卖。
en_us: Chen Ping'an withdrew his gaze as he jogged through a series of streets and alleys toward the eastern side of the small town. Clay Vase Valley was situated in the westernmost part of the town, and at the town gate on the easternmost part of the town was a man who was responsible for conducting nightly patrols and overseeing the merchants and visitors entering the exiting the town. On the side, he would also receive and transfer some letters sent to the town, and Chen Ping'an's job was to take those letters and deliver them to the town's residents for one copper coin per letter. This was an avenue of income that he had gone to great lengths to obtain, and it had already been arranged that he was going to be taking over this job after the day of the Longtaitou Festival.

source: 陈平安收回视线，轻声道：“宁姑娘，你有没有想过，我留着它们，不一定是好事情。见过齐先生之后，我更加确定这点。”
en_us: Chen Ping'an dragged his gaze back over, saying softly, "Ning Yao, have you considered that it might be a bad thing for me to keep them? After seeing Mr. Qi, I'm even more certain of this."

source: 陈平安收起宁姚借给自己的压衣刀，藏入右袖之中，对那个真武山的男人点头道：“如果有机会，我会的。”
en_us: Chen Ping'an put away the skirt dagger that Ning Yao had lent him, hiding it in his right sleeve. He then nodded at the man and said, "If I have the opportunity, I'll definitely go and look for you."

source: 陈平安收起思绪，低头看着那块黑色石头，想着要把它搬去铁匠铺子，宁姑娘肯定用得着这块磨剑石。至于到时候宁姑娘如何处置石头，是选择自己磨剑，还是交给阮师傅，作为帮忙铸剑的谢礼，陈平安反正无所谓，他只是很好奇磨剑石到底如何磨剑，会不是跟自己磨柴刀差不多？
en_us: Chen Ping'an set that train of thought aside as he continued to stare at the black stone, and he was considering moving it to the blacksmith shop as it would definitley come in useful for Ning Yao. As for what Ning Yao was going to do with the stone, whether that be using it to sharpen her own sword, or pass it onto Master Ruan as thanks for forging a sword for her, that didn't matter to Chen Ping'an. He was only curious about how one could go about sharpening their sword on this stone, and he wondered if it was the same process that he used to sharpen his bushcraft blades.

source: 陈平安放下新折的那根桃枝，吹灭蜡烛，走出屋子后，坐在台阶上，仰头望去，星空璀璨。
en_us: Chen Ping'an set down the newly snapped peach branch before blowing out the candle. He then made his way out of the room and sat down on the steps before looking up at the starry night sky.

source: 陈平安放下背篓，然后坐在院门口，擦着汗水。
en_us: After setting down the basket on his back, Chen Ping'an sat down at the entrance of his yard while wiping at the sweat on his forehead.

source: 陈平安放下草鞋、箩筐和竹篓，原本是想着三更半夜的，就打赤膊下水，现在就别想了，旁边就坐着个陌生的黄花大闺女，且不说她会不会尖叫，这要是给她家长辈看到或是听到，陈平安估计自己要被人打断两条腿，还不冤枉。
en_us: Chen Ping'an placed his straw sandals, large basket, and bamboo basket on the ground. He had initially wanted to dive shirtless, especially since it was night. However, this was not an option now. After all, there was an unfamiliar young girl sitting next to him. Even if she didn't scream, Chen Ping'an would still have his legs broken if her parents and elders were to see or hear about this. That would truly be a miserable and undeserved fate.

source: 陈平安放缓脚步，头疼道：“那咋办？就近找个地方藏起来？我本来是想离开小镇的，那个地方不容易被人找到。”
en_us: Chen Ping'an slowed down and said with a headache, "Then what should we do? Find somewhere nearby to hide? I actually wanted to leave the small town. There's a place that's not easy to find."

source: 陈平安放缓脚步，屋内响起中年人的醇厚嗓音，“日出有曜，羔裘如濡。”
en_us: He slowed down outside the school, and the mellow voice of a middle-aged man rang out from inside. "The radiant sun shines down upon the pristine woollen coat."

source: 陈平安斜靠着屋门，想着明天的光景，多半会像今天，后天的光景，则会像明天，如此反复，于是他陈平安这辈子就会一直这样走下去，直到最后跟姚老头差不多。
en_us: Chen Ping'an leaned against his doorframe as he thought about what the next day was going to be like. It was most likely going to be just like this day, and the day after the next day was going to be just like the next day. In his mind, he was going to live out his life in this repetitive cycle until he passed away just like Old Man Yao.

source: 陈平安斩钉截铁，语气坚定道：“没有！宁姑娘你放心！”
en_us: Chen Ping'an was firm and resolute as he replied, "No! Please be at ease!"

source: 陈平安无奈道：“你娘啥时候改嫁给你爹的”
en_us: Chen Ping'an said in exasperation, "When did your mother get remarried to your father?"

source: 陈平安无奈道：“你跟我比有啥用，跟宋集薪比啊，稚圭又不是我的丫鬟。”
en_us: Chen Ping'an was slightly exasperated as he replied, "Why are you comparing yourself to me? Why aren't you comparing yourself to Song Jixin? After all, Zhi Gui is his maidservant, not mine."

source: 陈平安无奈道：“宁姑娘你想多了。”
en_us: "Ning Yao, you're overthinking things," Chen Ping'an replied in exasperation.

source: 陈平安无奈道：“是个外地人，来自一个叫正阳山的地方。”
en_us: "It was an outsider from a place called the Sun Scorch Mountain," Chen Ping'an replied in a resigned manner.

source: 陈平安无奈道：“没有，小时候帮人放牛的时候，经常被牛尾巴甩过。”
en_us: "No," Chen Ping'an replied in exasperation. "However, I was often whipped in the head by cow tails when I helped others herd cattle."

source: 陈平安无意中察觉到呼吸有些凝滞，便坐在门槛上，屏气凝神，双手十指结剑炉拳桩。
en_us: Chen Ping'an could feel that his own breathing was a little labored, so he sat down onto the doorstep and joined his palms together as he focused on meditation.

source: 陈平安无言以对。
en_us: Chen Ping'an was rendered speechless upon hearing this.

source: 陈平安无言以对，不知为何，少年坐回位置，坐在台阶上，抬头望着南方的天空。
en_us: Chen Ping'an had no answer to this. For some reason, he sat back down on the stone steps, then raised his head to cast his gaze toward the sky in hte south.

source: 陈平安既狡黠又实诚道：“阮姑娘又不在这儿，可宁姑娘你在啊。”
en_us: A sly grin appeared on Chen Ping'an's face, but he replied in a truthful manner, "Because Ruan Xiu's not here, yet you're here with me right now."

source: 陈平安既诚恳又赧颜道：“暂时第三。”
en_us: Chen Ping'an flushed red and replied honestly, "Temporarily third."

source: 陈平安是个不算太明显的左撇子，于是与马苦玄的右手拳头，硬碰硬撞在一起。
en_us: Chen Ping'an was left-handed, though this wasn't especially evident. Thus, his left fist forcefully collided together with Ma Kuxuan's right fist.

source: 陈平安是穷苦出身，正因为拥有的东西太少，所以就格外斤斤计较，反观宋集薪卢正淳那样的富贵子弟，绝对不会在意口袋里有几枚铜钱，这是大行不顾细谨，陈平安当然不行。所以陈平安给人的印象，一直是跟拘谨、温吞和隐忍这些词汇沾边，少年理所应当的朝气蓬勃，反而不多，至于眼前那个莫名其妙跑出来，要跟陈平安宁姚打生打死的马苦玄，大概属于不可理喻的怪胎，宁姚至少还可以用锋芒毕露来形容，马苦玄这种就完全让人摸不着头脑了。
en_us: Chen Ping'an was born into an impoverished family, and it was exactly because he had far too few possessions that he was always so stingy about everything. In contrast, those born into rich families like Song Jixin and Lu Zhengchun would never care about how many copper coins they had in their pockets. They cared about the bigger picture, so they cared less about these trivial matters. However, Chen Ping'an naturally couldn't do this. Thus, the impression that Chen Ping'an gave others was that he was an extremely cautious person who was slightly indecisive but also very good at enduring things. Meanwhile, he didn't appear very lively and ambitious like the other youths. As for Ma Kuxuan, who had mysteriously run over to fight with him, he could most likely be regarded as a strange and eccentric person who was also very unreasonable. Ning Yao could still be described as sharp and unyielding, at least, but Ma Kuxuan was someone who would leave others scratching their heads.

source: 陈平安是财迷，绝对不是色胚。
en_us: Chen Ping'an was an avaricious person, but he was definitely not a pervert.

source: 陈平安更加无奈，“道长，可是我不识字啊”
en_us: "How am I supposed to follow the medicine brewing method you gave me? I'm illiterate!" Chen Ping'an exclaimed.

source: 陈平安最后抓上来七八条石板鱼，竹篓被它们撞得摇摇晃晃，脸色惨白的少年知道自己差不多极限了，春天的水冷，是往骨子里钻的那种，最主要当然还是受伤的左手经不住，陈平安最后一次上岸后，快步跳下青色石崖，钻入溪畔草丛里，发出一阵窸窸窣窣的声响，没过多久就拔出三四样草，不少草根带着泥土，一大把握在手心，捡了块普通石子，回到石崖后，找到石崖一处手心大小的天然小坑洼，擦干抹净后，开始轻轻捣捶草药，很快就变成一团青色的浆糊，汁水散发出春季水畔野草的独有芬芳。
en_us: In the end, Chen Ping'an caught another seven or eight rock slate fish, with their jumping and flopping causing the bamboo basket to rock back and forth. The pale-faced young boy knew that he was almost at his limit. The water was especially cold during spring, and this was a chilling cold that directly pierced into the bones. Most importantly, the wound on his left hand couldn't take so much stress. After returning onshore for the last time, Chen Ping'an jumped off the green stone cliff in haste and hurriedly scurried into the tall grass next to the creek. There was a lot of rustling, and after a short while, he pulled up three or four different kinds of grass, many of which still had soil hanging on their roots. Holding a bunch of grass in his hand, he then picked up an ordinary piece of rock. After returning to the stone cliff, he found a naturally formed pothole that was the size of his palm. After wiping it clean, he started to lightly crush the grass, which quickly became a blob of green paste. The unique and fresh fragrance of spring grass wafted through the air.

source: 陈平安最后拿起那根玉簪子，齐先生说是早年他的先生所赠，是寻常之物，并非什么奇珍异宝。
en_us: Finally, Chen Ping'an picked up that jade hairpin. Mr. Qi had told him that the hairpin had been bestowed upon him by his teacher, and that it was just an ordinary object as opposed to any exotic treasure.

source: 陈平安最后说道：“道长说你写的符纸，烧了后，能够给我爹娘带去好运，我其实是相信道长的。所以道长找上门来，说让我救人，我刚才没有说什么，但是我希望道长答应我一件事情，如果答应，接下来道长不管要我做什么，都没有问题，如果道长不答应，这趟抓了药方，再帮道长煎完了药，我就会赶人了。”
en_us: Chen Ping'an continued, "You told me that by burning the paper talisman that you gave me, I could bring good fortune to my parents in the afterlife, and to be honest, I believe you. That's why I didn't ask any questions when you came to me and asked me to save that woman. However, I want you to promise me one thing. If you agree to make that promise, I'm willing to do whatever you want me to do. However, if you refuse, then after fetching you these ingrdients and helping you make the medicine required to cure that woman, I'll have to ask both of you to leave."

source: 陈平安有些为难，毕竟他未必真有时间来此听这位先生教书，少年不愿欺骗他。
en_us: Chen Ping'an was reluctant to make any promises. He couldn't guarantee that he would have the time to come and listen to these lessons, and he didn't want to lie to the teacher.

source: 陈平安有些奇怪，这副黑炭似的铁甲，丑归丑，但是刘羡阳是真打心眼将它当做了传家宝，哪怕是陈平安这样的交情，这么多年来也只给看了一回，不到半炷香就又小心翼翼搬回朱漆箱子，供奉起来。
en_us: Chen Ping'an found Liu Xianyang's attitude toward the suit of armor quite strange. The charcoal-like suit of armor was indeed very ugly, but Liu Xianyang genuinely treated it like it was a treasure that had been passed down through the generations. Even as close as he was to Chen Ping'an, he had only shown this suit of armor to him once. Moreover, he had carefully placed it back inside the vermillion case after just a few minutes.

source: 陈平安有些奇怪，难道这些人还不知道朝廷已经封禁了所有龙窑？还是说他们正因为知道真相，所以觉得有机可乘？
en_us: Chen Ping'an was rather perplexed to see this. Could it be that these people weren't aware that the imperial court had already shut down all of the dragon kilns in the village? Alternatively, could it be that they felt like there was an opportunity to be exploited here because they knew the true reason for the closure of the kilns?

source: 陈平安有些尴尬，只好帮顾粲那个兔崽子说好话，打圆场道：“其实他心眼不坏的，就是说话难听了点。”
en_us: Chen Ping'an felt slightly awkward. In the end, he could only put in some good words for that little brat Gu Can, saying, "In reality, he doesn't have any bad intentions. It's just that his words are a little crude and jarring."
